In [43]:
import pandas as pd
import numpy as np

# Column Operation

In [69]:
df2=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'],index=['r1','r2','r3'])
df2=df2[['roll','name','marks']]
df2

    roll name  marks
r1     1    a    500
r2     2    b    600
r3     3    c    700

In [66]:
# Dataframe Copy
df3=df2.copy()

In [ ]:
df3[:,["",""]]

In [70]:
# Rename Columns
df3.rename({'roll':'Roll No.','name':'Name',"marks":"Marks"},axis=1,inplace=True)
df3

   Name  Roll No.  Marks
r1    a         1    500
r2    b         2    600
r3    c         3    700

In [71]:
# Index Rename
df3.rename({'r1':'1','r2':'2','r3':'3'},axis=0,inplace=True)
df3

  Name  Roll No.  Marks
1    a         1    500
2    b         2    600
3    c         3    700

In [72]:
# Set Index
df3=df3.set_index('Roll No.')
df3

         Name  Marks
Roll No.
1           a    500
2           b    600
3           c    700

In [73]:
# Add Column
df3.insert(1,'Subject',[1,2,3])
df3

         Name  Subject  Marks
Roll No.
1           a        1    500
2           b        2    600
3           c        3    700

In [74]:
# Pop Columns
df3.pop('Subject')

Roll No.
1    1
2    2
3    3
Name: Subject, dtype: int64

In [75]:
# Delete Column
df3.drop('Marks',axis=1,inplace=True)
df3

         Name
Roll No.
1           a
2           b
3           c

### Selection

In [9]:
dates = pd.date_range('1/1/2000', periods=20)
df = pd.DataFrame(np.random.randn(20, 4),index=dates, columns=['size', 'B', 'C', 'D'])
df

                size         B         C         D
2000-01-01  0.562777  2.250639  0.205139  0.285638
2000-01-02 -0.650064  0.395713  2.102489 -0.593390
2000-01-03  1.305870  0.876849  1.014990 -1.033936
2000-01-04 -1.047024  1.061816  0.973878 -1.107483
2000-01-05 -0.506488 -1.049668  0.646242  0.431060
2000-01-06  0.835833 -0.638323 -0.015494  1.126452
2000-01-07  1.588773 -0.217533 -2.024103 -0.654129
2000-01-08  0.692214  1.086949 -1.100901 -0.511867
2000-01-09 -0.016430  0.229025  1.102202 -1.364276
2000-01-10  0.178080 -0.086831  0.250497  2.223479
2000-01-11 -0.236104  0.228117 -0.833138 -0.593797
2000-01-12 -1.136196  1.290314 -0.379839  0.231353
2000-01-13  0.158092  0.545211 -1.121771 -0.269120
2000-01-14 -0.006626  0.309229 -1.129010 -0.822475
2000-01-15  0.349188 -0.848515  0.142099  2.793648
2000-01-16 -0.799887 -0.758970 -2.205580 -0.537537
2000-01-17  0.301093 -0.273237  0.466849  1.879767
2000-01-18  1.799523  0.685070 -2.974407 -0.723135
2000-01-19  1.880024  0.450504 -1.431357  1.047804
2000-01-20  0.804330  0.996507  1.182505  1.259324

**Attribute**

In [16]:
# df.size   #80
# df['size']

In [17]:
# df.B

In [ ]:
# df['B']

In [19]:
# df[['B', 'C']]

**Slicing with labels & Range**

In [27]:
 df[:3]   #row Select

                size         B         C         D
2000-01-01  0.562777  2.250639  0.205139  0.285638
2000-01-02 -0.650064  0.395713  2.102489 -0.593390
2000-01-03  1.305870  0.876849  1.014990 -1.033936

In [28]:
 df[:23]

                size         B         C         D
2000-01-01  0.562777  2.250639  0.205139  0.285638
2000-01-02 -0.650064  0.395713  2.102489 -0.593390
2000-01-03  1.305870  0.876849  1.014990 -1.033936
2000-01-04 -1.047024  1.061816  0.973878 -1.107483
2000-01-05 -0.506488 -1.049668  0.646242  0.431060
2000-01-06  0.835833 -0.638323 -0.015494  1.126452
2000-01-07  1.588773 -0.217533 -2.024103 -0.654129
2000-01-08  0.692214  1.086949 -1.100901 -0.511867
2000-01-09 -0.016430  0.229025  1.102202 -1.364276
2000-01-10  0.178080 -0.086831  0.250497  2.223479
2000-01-11 -0.236104  0.228117 -0.833138 -0.593797
2000-01-12 -1.136196  1.290314 -0.379839  0.231353
2000-01-13  0.158092  0.545211 -1.121771 -0.269120
2000-01-14 -0.006626  0.309229 -1.129010 -0.822475
2000-01-15  0.349188 -0.848515  0.142099  2.793648
2000-01-16 -0.799887 -0.758970 -2.205580 -0.537537
2000-01-17  0.301093 -0.273237  0.466849  1.879767
2000-01-18  1.799523  0.685070 -2.974407 -0.723135
2000-01-19  1.880024  0.450504 -1.431357  1.047804
2000-01-20  0.804330  0.996507  1.182505  1.259324

In [29]:
# df[:2]

In [36]:
# s[::-1]

In [38]:
df.loc[:, ['B', 'C']]

                   B         C
2000-01-01  2.250639  0.205139
2000-01-02  0.395713  2.102489
2000-01-03  0.876849  1.014990
2000-01-04  1.061816  0.973878
2000-01-05 -1.049668  0.646242
2000-01-06 -0.638323 -0.015494
2000-01-07 -0.217533 -2.024103
2000-01-08  1.086949 -1.100901
2000-01-09  0.229025  1.102202
2000-01-10 -0.086831  0.250497
2000-01-11  0.228117 -0.833138
2000-01-12  1.290314 -0.379839
2000-01-13  0.545211 -1.121771
2000-01-14  0.309229 -1.129010
2000-01-15 -0.848515  0.142099
2000-01-16 -0.758970 -2.205580
2000-01-17 -0.273237  0.466849
2000-01-18  0.685070 -2.974407
2000-01-19  0.450504 -1.431357
2000-01-20  0.996507  1.182505

In [ ]:
# df.iloc[:,1:]

## Column-Data Handling

In [46]:
df1=pd.DataFrame([['A',1,100],['B',2,200],['C',3,300],['D',4,400],['E',5,500],['F',6,600],['G',7,100],['H',8,200],['J',9,900],['J',10,1000],['E',11,1100],['I',12,1200]],columns=['Name','Roll_No','Marks'])
df1.to_csv('temp/Pandas.csv',index=False)
df1

   Name  Roll_No  Marks
0     A        1    100
1     B        2    200
2     C        3    300
3     D        4    400
4     E        5    500
5     F        6    600
6     G        7    100
7     H        8    200
8     J        9    900
9     J       10   1000
10    E       11   1100
11    I       12   1200

In [49]:
df2=pd.read_csv('temp/Pandas.csv',index_col ="Roll_No")
df2

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300
4          D    400
5          E    500
6          F    600
7          G    100
8          H    200
9          J    900
10         J   1000
11         E   1100
12         I   1200

In [92]:
# tips=pd.read_csv('_dataset/tips.csv')
# tips

## Attribute

In [50]:
df2.columns

Index(['Name', 'Marks'], dtype='object')

In [51]:
df2.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], dtype='int64', name='Roll_No')

In [52]:
df2.size

24

In [53]:
df2.shape

(12, 2)

In [54]:
# Transpose
df2.T

Roll_No   1    2    3    4    5    6    7    8    9     10    11    12
Name       A    B    C    D    E    F    G    H    J     J     E     I
Marks    100  200  300  400  500  600  100  200  900  1000  1100  1200

## Methods

In [55]:
# df2.head()
df2.head(3)

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300

In [56]:
# df2.tail()
df2.tail(3)

        Name  Marks
Roll_No
10         J   1000
11         E   1100
12         I   1200

In [57]:
df2.describe()

             Marks
count    12.000000
mean    550.000000
std     403.394686
min     100.000000
25%     200.000000
50%     450.000000
75%     925.000000
max    1200.000000

In [103]:
df2.to_numpy()

array([['A', 100],
       ['B', 200],
       ['C', 300],
       ['D', 400],
       ['E', 500],
       ['F', 600],
       ['G', 100],
       ['H', 200],
       ['J', 900],
       ['J', 1000],
       ['E', 1100],
       ['I', 1200]], dtype=object)

In [62]:
# unique
print(len(df2.Name))

12

In [63]:
print(len(df2.Name.unique()))

10

In [66]:
df2.Name.value_counts()

J    2
E    2
G    1
B    1
I    1
A    1
C    1
F    1
D    1
H    1
Name: Name, dtype: int64

In [111]:
# set(df2.Name)
df1.Name.unique()

12
10

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'I'], dtype=object)

In [105]:
df1.Marks.value_counts()

100     2
200     2
400     1
900     1
500     1
600     1
1100    1
300     1
1000    1
1200    1
Name: Marks, dtype: int64

In [67]:
df1[df1.Marks==200]

  Name  Roll_No  Marks
1    B        2    200
7    H        8    200

In [86]:
a=df1[(df1.Marks==200) & (df1.Name=="B")]
a.head()

  Name  Roll_No  Marks
1    B        2    200

In [87]:
a=df1[df1.Marks>1000]
a.head()

   Name  Roll_No  Marks
10    E       11   1100
11    I       12   1200

In [69]:
list(range(4,9))

[4, 5, 6, 7, 8]

In [88]:
# a=df[df.Roll_No.isin(range(4,9))]
a=df1[df1.index.isin(range(4,9))]
a.head()

  Name  Roll_No  Marks
4    E        5    500
5    F        6    600
6    G        7    100
7    H        8    200
8    J        9    900

**groupby() operation**

In [76]:
tips=pd.read_csv('_dataset/tips.csv')
tips.head()

   total_bill   tip  gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [74]:
tips.groupby('day').total_bill.describe()

      count       mean       std   min      25%    50%      75%    max
day
Fri    19.0  17.151579  8.302660  5.75  12.0950  15.38  21.7500  40.17
Sat    87.0  20.441379  9.480419  3.07  13.9050  18.24  24.7400  50.81
Sun    76.0  21.410000  8.832122  7.25  14.9875  19.63  25.5975  48.17
Thur   62.0  17.682742  7.886170  7.51  12.4425  16.20  20.1550  43.11

In [ ]:
#count,mean,std,min,max

In [78]:
tips.groupby('day').total_bill.min()

day
Fri     5.75
Sat     3.07
Sun     7.25
Thur    7.51
Name: total_bill, dtype: float64

In [115]:
tips.groupby('day').agg(['min','max','mean','sum'])

     total_bill                              tip                           \
            min    max       mean      sum   min    max      mean     sum
day
Fri        5.75  40.17  17.151579   325.88  1.00   4.73  2.734737   51.96
Sat        3.07  50.81  20.441379  1778.40  1.00  10.00  2.993103  260.40
Sun        7.25  48.17  21.410000  1627.16  1.01   6.50  3.255132  247.39
Thur       7.51  43.11  17.682742  1096.33  1.25   6.70  2.771452  171.83

     size
      min max      mean  sum
day
Fri     1   4  2.105263   40
Sat     1   5  2.517241  219
Sun     2   6  2.842105  216
Thur    1   6  2.451613  152

### Map And apply:
    - Each Element in row Operation

In [117]:
df2

        Name  Marks
Roll_No
1          A    100
2          B    200
3          C    300
4          D    400
5          E    500
6          F    600
7          G    100
8          H    200
9          J    900
10         J   1000
11         E   1100
12         I   1200

In [119]:
names=df2.Name
size=[]
for n in names:
    size.append(len(n))
size

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

In [80]:
df2.Name.apply(len)

Roll_No
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
Name: Name, dtype: int64

In [81]:
df2.Name.map(len)

Roll_No
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
Name: Name, dtype: int64